module.exports = {
	view: '/list/list.ftl',
	out: '/list.html',
	data: {
		assets: './assets',
		server: '[{name:"西南电信一区",id:1,server:[{id:2025,name:"天蝎座"},{id:191,name:"蜀南竹海"},{id:194,name:"梅里雪山"},{id:194,name:"天池龙宫"},{id:195,name:"西双版纳"},{id:193,name:"香格里拉"},{id:193,name:"茶马古道"},{id:198,name:"剑门蜀道"},{id:198,name:"九寨沟"},{id:200,name:"黄果树"},{id:197,name:"峨嵋山"},{id:201,name:"蝴蝶泉"},{id:209,name:"都江堰"},{id:1163,name:"千寻塔"},{id:211,name:"无量山"},{id:68,name:"阿紫"},{id:68,name:"甘露酒"},{id:1163,name:"普洱茶"},{id:1163,name:"功夫茶"},{id:1161,name:"平安扣"},{id:1163,name:"宝葫芦"},{id:1171,name:"相思河"},{id:1161,name:"忘忧谷"},{id:1171,name:"乐山大佛"},{id:1061,name:"束河古镇"},{id:1061,name:"朝天门"},{id:1171,name:"临江书院"},{id:1171,name:"鹤翼阵"},{id:2020,name:"第二食堂"},{id:1061,name:"棉花糖"},{id:1061,name:"铁莲子"},{id:2025,name:"巨蟹座"},{id:2025,name:"处女座"},{id:2020,name:"桃花阵"},{id:2025,name:"天蝎座"},{id:2210,name:"乾坤无极"},{id:2025,name:"雁南飞"},{id:2210,name:"玉楼春"},{id:2028,name:"金风玉露"}]},{name:"网通-无双网通",id:2,server:[{id:3192,name:"独孤求败"},{id:3192,name:"忘川花海"},{id:3161,name:"降龙伏虎"},{id:3192,name:"英雄本色"},{id:3197,name:"名扬天下"},{id:3161,name:"威震天下"},{id:3197,name:"龙战九州"},{id:4022,name:"紫电青霜"},{id:4022,name:"仗剑江湖"},{id:3197,name:"心心相印"},{id:4023,name:"壮志凌云"},{id:4023,name:"名震天下"},{id:4023,name:"呼风唤雨"},{id:4022,name:"一统江湖"},{id:4023,name:"群龙聚首"},{id:3197,name:"如日中天"},{id:3172,name:"霸者无双"},{id:4022,name:"倚天屠龙"},{id:3181,name:"九天揽月"},{id:4023,name:"阳关三叠"},{id:4018,name:"血战江湖"},{id:4022,name:"战无不胜"},{id:4026,name:"风雨同舟"},{id:4022,name:"龙争虎斗"},{id:4023,name:"厉兵秣马"},{id:4022,name:"武动乾坤"}]},{name:"南部电信二区",id:3,server:[{id:9140,name:"烟雨轩"},{id:2145,name:"紫气东来"}]},{name:"网通-网通二区",id:4,server:[{id:1043,name:"太清宫"},{id:1140,name:"玄雷击杀"},{id:1140,name:"偃月阵"},{id:1043,name:"玫瑰花"},{id:1043,name:"爆米花"},{id:1140,name:"透骨钉"},{id:1140,name:"永恒"},{id:1043,name:"双子座"},{id:2085,name:"许愿树"},{id:2085,name:"段誉"},{id:2093,name:"锦绣中华"},{id:2085,name:"长河落日"},{id:2085,name:"将进酒"},{id:2085,name:"灵魂战甲"},{id:2085,name:"龙腾虎跃"}]},{name:"华东电信二区",id:5,server:[{id:1191,name:"五峰书院"},{id:1035,name:"天一阁"},{id:1017,name:"极冰凝杀"},{id:1017,name:"鱼鳞阵"},{id:1017,name:"女生宿舍"},{id:1017,name:"开心果"},{id:1017,name:"飞蝗石"},{id:1017,name:"盘龙"},{id:1035,name:"白羊座"},{id:1035,name:"瑶池仙境"},{id:1017,name:"彩云之南"},{id:1017,name:"王语嫣"},{id:2203,name:"回风舞雪"},{id:2203,name:"满江红"},{id:2203,name:"武魂传说"},{id:2203,name:"卧虎藏龙"}]},{name:"东部电信二区",id:6,server:[{id:1010,name:"金钱镖"},{id:1010,name:"金牛座"},{id:1189,name:"射手座"},{id:2203,name:"雪莲花"},{id:1010,name:"剑舞江南"},{id:2203,name:"沧浪亭"},{id:2203,name:"山河情"},{id:2203,name:"月光宝盒"}]},{name:"双线-超级双线",id:7,server:[{id:3200,name:"天龙"},{id:3201,name:"玄海"},{id:3202,name:"天下"},{id:3203,name:"江湖"},{id:3205,name:"红尘"},{id:3205,name:"盛世"},{id:3206,name:"战魂"},{id:3206,name:"雄霸"},{id:3203,name:"东方不败"},{id:3201,name:"笑傲"},{id:3202,name:"英雄"},{id:3206,name:"风云"},{id:3205,name:"无双"},{id:5011,name:"灭世"},{id:5012,name:"王权"}]},{name:"华东电信一区",id:8,server:[{id:1191,name:"天目山"},{id:137,name:"太湖仙岛"},{id:168,name:"三潭印月"},{id:36,name:"东方明珠"},{id:140,name:"断桥残雪"},{id:152,name:"外滩夜色"},{id:140,name:"莲峰云海"},{id:154,name:"崇明春色"},{id:154,name:"枫桥夜泊"},{id:152,name:"虎丘剑池"},{id:96,name:"风雨钟山"},{id:152,name:"黄浦江"},{id:140,name:"钱塘江"},{id:149,name:"雨花台"},{id:168,name:"九华山"},{id:1017,name:"千岛湖"},{id:96,name:"花果山"},{id:152,name:"雁荡山"},{id:188,name:"琅琊山"},{id:154,name:"双龙洞"},{id:155,name:"上海滩"},{id:155,name:"烟雨楼"},{id:40,name:"普陀山"},{id:36,name:"城隍庙"},{id:154,name:"雷峰塔"},{id:40,name:"玄武岛"},{id:36,name:"燕子坞"},{id:188,name:"阿朱"},{id:44,name:"冥界"},{id:96,name:"游坦之"},{id:96,name:"状元红"},{id:96,name:"猴儿酒"},{id:168,name:"西湖龙井"},{id:1017,name:"行者无双"},{id:1035,name:"玉如意"},{id:1035,name:"龙凤镯"},{id:44,name:"连理枝"},{id:1035,name:"月牙泉"},{id:1191,name:"天目山"},{id:1035,name:"东林书院"},{id:1035,name:"浔阳楼"}]},{name:"网通-华北网通一区",id:9,server:[{id:4155,name:"不冻泉"},{id:101,name:"紫禁之巅"},{id:22,name:"白云古洞"},{id:103,name:"蓬莱仙境"},{id:1053,name:"云冈石窟"},{id:118,name:"桃园仙谷"},{id:109,name:"马踏飞燕"},{id:1052,name:"塞外蟠龙"},{id:109,name:"水泊梁山"},{id:25,name:"少室晴雪"},{id:111,name:"八达岭"},{id:112,name:"少林寺"},{id:118,name:"五台山"},{id:1037,name:"山海关"},{id:118,name:"沂蒙山"},{id:1037,name:"悬空寺"},{id:118,name:"北戴河"},{id:111,name:"颐和园"},{id:25,name:"光明顶"},{id:1046,name:"雁门关"},{id:1037,name:"二锅头"},{id:1037,name:"雄黄酒"},{id:1053,name:"香露茶"},{id:1052,name:"盖碗茶"},{id:1046,name:"玉扳指"},{id:1046,name:"吉祥锁"},{id:1046,name:"鸣沙山"},{id:1053,name:"什刹海"},{id:1046,name:"太行山"},{id:1046,name:"居庸关"},{id:1052,name:"清风楼"},{id:1053,name:"漳南书院"},{id:1138,name:"晋阳书院"},{id:1046,name:"秦皇古道"},{id:1046,name:"雁行阵"},{id:4155,name:"足球场"},{id:1052,name:"玉蜂针"},{id:2160,name:"摩羯座"},{id:2160,name:"天秤座"},{id:4155,name:"不冻泉"},{id:2082,name:"熊猫龙龙"}]},{name:"中西部电信",id:10,server:[{id:2022,name:"黑血神针"},{id:66,name:"六脉神剑"},{id:182,name:"五毒秘传"},{id:68,name:"齐眉棍"},{id:68,name:"一阳指"},{id:195,name:"罗汉拳"},{id:195,name:"龙爪手"},{id:66,name:"泥鳅功"},{id:182,name:"金钟罩"},{id:182,name:"弹指神通"},{id:182,name:"真武七截阵"},{id:1171,name:"李庄古镇"},{id:197,name:"太阿剑"},{id:195,name:"苏星河"},{id:197,name:"李秋水"},{id:195,name:"云中鹤"},{id:197,name:"地界"},{id:197,name:"竹叶青"},{id:1171,name:"关中书院"},{id:2022,name:"黑血神针"},{id:2022,name:"盛世长安"}]},{name:"网通-超级网通",id:11,server:[{id:4025,name:"独步江湖"},{id:4026,name:"王者至尊"},{id:4018,name:"号令天下"},{id:4023,name:"深海迷踪"},{id:4026,name:"刀剑如梦"},{id:4023,name:"怒海惊涛"},{id:4018,name:"皇图霸业"},{id:4023,name:"天下王城"},{id:4026,name:"盖世豪杰"},{id:4018,name:"行云流水"},{id:4025,name:"剑锁江山"}]},{name:"华中电信一区",id:12,server:[{id:1061,name:"巧克力"},{id:66,name:"赤壁怀古"},{id:182,name:"洞庭秋月"},{id:66,name:"白马禅寺"},{id:182,name:"湘江夜色"},{id:188,name:"庐山飞瀑"},{id:1167,name:"秀峰梦境"},{id:186,name:"黄鹤楼"},{id:188,name:"滕王阁"},{id:63,name:"张家界"},{id:63,name:"聚贤庄"},{id:1167,name:"檀香扇"},{id:1167,name:"浏阳河"},{id:1167,name:"芙蓉镇"},{id:1167,name:"天心阁"},{id:1167,name:"石鼓书院"},{id:1167,name:"南湖书院"},{id:1167,name:"劫火焚杀"},{id:1061,name:"八卦阵"},{id:1061,name:"巧克力"},{id:2021,name:"烤鱼片"},{id:2021,name:"花装弩"},{id:2021,name:"时空裂缝"},{id:2020,name:"天帝城"},{id:2020,name:"梦回连营"},{id:2021,name:"逐鹿中原"},{id:2020,name:"乔峰"},{id:2020,name:"铁血丹心"}]},{name:"至尊电信",id:13,server:[{id:3081,name:"唯我独尊"},{id:3082,name:"万敌不侵"},{id:3084,name:"破武修心"},{id:3084,name:"天荒古境"},{id:3076,name:"破天一剑"},{id:3077,name:"披荆斩棘"},{id:3085,name:"天外江湖"},{id:3077,name:"剑舞春秋"},{id:3084,name:"叱咤风云"},{id:3085,name:"豪情壮志"},{id:3077,name:"傲视群雄"},{id:3077,name:"碧海苍穹"},{id:3079,name:"雪舞燃情"},{id:3092,name:"龙腾万里"},{id:3076,name:"春花秋月"},{id:3085,name:"凤鸣九天"},{id:3063,name:"替天行道"},{id:3063,name:"御龙在天"},{id:3084,name:"缘定三生"},{id:3079,name:"剑气如虹"},{id:3063,name:"赤胆忠心"},{id:3085,name:"乱世群雄"},{id:3028,name:"铁血战歌"},{id:3082,name:"仁者无敌"},{id:3082,name:"龙啸九州"},{id:3119,name:"龙战九天"},{id:3133,name:"气壮山河"},{id:3116,name:"海纳百川"},{id:3135,name:"锦绣河山"},{id:3116,name:"江山如画"},{id:3138,name:"步步为营"},{id:3119,name:"游龙戏凤"},{id:3116,name:"一战倾城"},{id:3138,name:"秋水无痕"},{id:3115,name:"猎命江湖"},{id:3115,name:"烽火连天"},{id:3116,name:"横刀立马"},{id:3116,name:"盛世天下"},{id:3119,name:"普天同庆"},{id:3135,name:"问鼎天下"},{id:3133,name:"月满西楼"},{id:3115,name:"群雄逐鹿"},{id:3115,name:"精忠报国"},{id:3119,name:"天龙客栈"}]},{name:"网通-唯美网通(新)",id:14,server:[{id:4038,name:"月落西山"},{id:4037,name:"水月洞天"},{id:4036,name:"武林至尊"},{id:4039,name:"战魂不灭"},{id:4040,name:"烽烟四起"}]},{name:"网通-东北网通一区",id:15,server:[{id:2085,name:"潜龙之渊"},{id:22,name:"林海雪原"},{id:24,name:"长白天池"},{id:128,name:"官马溶洞"},{id:128,name:"白山黑水"},{id:128,name:"雾凇翠柏"},{id:131,name:"松花江畔"},{id:134,name:"鸭绿江"},{id:22,name:"兴安岭"},{id:134,name:"凤凰山"},{id:128,name:"珍宝岛"},{id:131,name:"奉天府"},{id:22,name:"水晶湖"},{id:24,name:"老虎滩"},{id:1052,name:"中国结"},{id:1052,name:"金元宝"},{id:1052,name:"镜泊湖"},{id:1138,name:"玉佛苑"},{id:1138,name:"大乘寺"},{id:2085,name:"银冈书院"},{id:1138,name:"会宁府"},{id:1138,name:"七星阵"},{id:1138,name:"恋曲2009"},{id:1138,name:"血滴子"},{id:1138,name:"水瓶座"},{id:1138,name:"玉虚幻境"},{id:2085,name:"潜龙之渊"},{id:2085,name:"秋叶红"},{id:2085,name:"剑胆琴心"},{id:2093,name:"弹指神功"}]},{name:"东部电信",id:16,server:[{id:38,name:"九阴真经"},{id:39,name:"玉女心经"},{id:40,name:"北冥神功"},{id:40,name:"雁翎枪"},{id:55,name:"七伤拳"},{id:55,name:"大力金刚指"},{id:38,name:"蓝砂手"},{id:44,name:"亢龙有悔"},{id:1010,name:"葵花宝典"},{id:58,name:"飞龙在天"},{id:47,name:"神龙摆尾"},{id:47,name:"含沙射影"},{id:47,name:"斗转星移"},{id:47,name:"寒冰掌"},{id:55,name:"蛤蟆功"},{id:55,name:"莫邪剑"},{id:39,name:"贪狼剑"},{id:58,name:"慕容博"},{id:55,name:"无崖子"},{id:55,name:"叶二娘"},{id:44,name:"鸠摩智"},{id:149,name:"天界"},{id:1110,name:"枯荣长老"},{id:1010,name:"烧刀子"},{id:1110,name:"仙人醉"},{id:1189,name:"花雕"},{id:1187,name:"冻顶乌龙"},{id:1015,name:"云雾茶"},{id:1110,name:"珊瑚珠"},{id:1187,name:"富贵竹"},{id:1110,name:"自习室"},{id:1024,name:"高山流水"},{id:1024,name:"扬子江"},{id:1187,name:"天宁寺"},{id:1110,name:"2008"},{id:1110,name:"万松书院"},{id:1187,name:"寒山寺"},{id:1010,name:"长蛇阵"},{id:1100,name:"栖霞山"},{id:1100,name:"同桌的你"}]},{name:"网通-网通全国一区",id:17,server:[{id:2151,name:"楼兰夜雪"},{id:2151,name:"紫霞小筑"},{id:4155,name:"世外桃源"},{id:2160,name:"伊兰雪山"},{id:2151,name:"妙笔仙音"},{id:2151,name:"玉门叠翠"},{id:2093,name:"桃花扇"},{id:4155,name:"圣火宫"},{id:2160,name:"君临天下"},{id:2151,name:"踏雪无痕"},{id:3166,name:"天外飞仙"},{id:3181,name:"大风歌"},{id:3166,name:"丝绸之路"},{id:3181,name:"漫天花雨"},{id:3166,name:"平湖秋月"},{id:3181,name:"勿忘江湖"},{id:3166,name:"寻缘镜"},{id:3181,name:"天下桃李"},{id:3161,name:"心有灵犀"},{id:3166,name:"仗剑天涯"},{id:3161,name:"刀光剑影"},{id:3166,name:"嫦娥奔月"},{id:3166,name:"花开盛世"},{id:3181,name:"雁门烽火"},{id:3181,name:"气吞山河"},{id:3166,name:"兵临城下"},{id:3197,name:"河南"},{id:3166,name:"龙门石窟"},{id:3197,name:"河南江湖"},{id:3161,name:"踏雪寻梅"},{id:3172,name:"雪山飞狐"},{id:3166,name:"功成名就"},{id:3161,name:"风花雪月"},{id:3166,name:"古韵华筝"},{id:3172,name:"凤舞九天"},{id:3172,name:"秦时明月"},{id:3166,name:"风起云涌"},{id:3172,name:"龙腾盛世"},{id:3181,name:"义薄云天"},{id:3181,name:"谁与争锋"},{id:3192,name:"天下无双"},{id:3192,name:"荷塘月色"},{id:3197,name:"清风明月"},{id:3197,name:"梧桐细雨"},{id:3192,name:"黄沙百战"}]},{name:"超级电信",id:18,server:[{id:3125,name:"天下第一"},{id:3128,name:"倾国倾城"},{id:3134,name:"龙吟九霄"},{id:3134,name:"百战江湖"},{id:3133,name:"怒火连斩"},{id:3131,name:"定海神针"},{id:3131,name:"天涯明月"},{id:3131,name:"剑啸江湖"},{id:3133,name:"纵横沙场"},{id:3134,name:"长风破浪"},{id:3135,name:"风云天下"},{id:3135,name:"天地无极"},{id:3135,name:"大悲手印"},{id:3138,name:"再战江湖"},{id:3135,name:"侠影无踪"},{id:5010,name:"万剑归宗"}]},{name:"双线-唯美双线(新)",id:19,server:[{id:5013,name:"天命"}]}]',
		filter: [
			{
				type: "商品分类",
				sub: [
					{
						name: "角色",
						key: 1,
					},
					{
						name: "道具",
						key: 2,
					},
					{
						name: "游戏币",
						key: 3,
					},
					{
						name: "礼包特卖",
						key: 4
					}
				]
			},
			{
				type: "商品状态",
				sub: [
					{
						name: '代售商品',
						key: '1',
					},
					{
						name: '公示商品',
						key: '2'
					}
				]
			},
			{
				type: "售卖类型",
				sub: [
					{
						name: '玩家售卖',
						key: 1
					},
					{
						name: '官方特卖',
						key: 2
					}
				]
			}
		]
	}
};